## Lendo arquivo formatados em Excel
  - Formatado: todo ele tem m colunas uniformes
  - Nã formatado: tem estruturas de colunas distintas que precisam ser lidas separamente
  
### Um arquivo excel pode ser:
  - xls ou xlsx
  - uma aba, ou multi-abas

### Deu um erro ao tentar ler Excel com Pandas:
  - XLRDError

In [2]:
import os
# se o pandas, abaixo, não consegui ler o arquivo Excel, é por que falta o pacote XLRD
# remova o comentário na frente de os.system(), e corra esta célula

# os.system("conda install -c anaconda xlrd")

In [3]:
import os, sys
import numpy as np
import pandas as pd

import matplotlib.pyplot as plt # matplotlib e seu alias plt
%matplotlib inline

In [4]:
root_data = '../data/'
# alguém me mando este arquivo
filename = 'Snake Morphotaxonomy.xlsx'

### A maneira correta de juntar path + filename

In [5]:
fullpath = os.path.join(root_data, filename)
os.path.exists(fullpath)

True

In [6]:
try:
    df = pd.read_excel(fullpath)
    print("Read '%s'"%fullpath)
except:
    print("Could not read '%s'"%fullpath)

Read '../data/Snake Morphotaxonomy.xlsx'

In [7]:
df.head()

      species population     sex  RDS   VS    HL   TaL  temperature  elevation
0  B_jararaca   RJ_serra  Female   23  144  25.0  34.0         20.3        894
1  B_jararaca   RJ_serra  Female   23  145  25.0  43.0         20.3        894
2  B_jararaca   RJ_serra  Female   23  144  17.0  18.0         23.2        173
3  B_jararaca   RJ_serra  Female   23  144  31.0  51.0         23.2        173
4  B_jararaca   RJ_serra  Female   25  143  30.0  41.0         24.4         59

In [8]:
df.tail()

    species population     sex  RDS   VS    HL   TaL  temperature  elevation
235   B_new   Colombia  Female   25  145  32.0  53.0         21.5       1173
236   B_new   Colombia  Female   25  146  29.0  42.0         21.5       1173
237   B_new   Colombia  Female   23  146  29.0  43.0         26.0        587
238   B_new   Colombia  Female   23  150  36.0  50.0         22.0       1065
239   B_new   Colombia  Female   23  147  30.0  50.0         21.5       1176

In [9]:
df.columns

Index(['species', 'population', 'sex', 'RDS', 'VS', 'HL', 'TaL', 'temperature',
       'elevation'],
      dtype='object')

###  Columns
  - sex - genero
  - RDS - half body number scales
  - VS  - Ventral scales
  - HL  - head length
  - TaL - tail length
  - temperature - graus Celsius
  - elevation - altitude (m)

### Quantas espécies?

In [10]:
specList = df.species.unique()
len(specList), specList

(3, array(['B_jararaca', 'B_terrificus', 'B_new'], dtype=object))

### Quantas regiões?

In [11]:
popList = df.population.unique()
len(popList), popList

(9,
 array(['RJ_serra', 'RJ_costa', 'Chile_costa', 'Chile_serra',
        'SP_planalto', 'SP_costa', 'Nordeste', 'Centro-oeste', 'Colombia'],
       dtype=object))